package com.pakhomovHW6;

import java.sql.Time;
import java.util.Arrays;

public class TestPhone {
    /**
     * Phone: id, Фамилия, Имя, Отчество, Адрес, Номер телфона,
     * Номер кредитной карточки, Дебет, Кредит, Время городских и междугородных разговоров,
     * трафик интернета
     */
    public static void main(String[] args) {
        int id = 1001;
        Phone mas[] = {
                new Phone(id++, "Дуров", "Павел", "Осипович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:29:00"), Time.valueOf("00:00:00"), 10000),
                new Phone(id++, "Дорохов", "Павел", "Алексеевич", "Украина, г.Харьков", "+9 847 56 47", "5431 4567 7685 8917", 1467, 567, Time.valueOf("00:45:00"), Time.valueOf("00:10:00"), 1500),
                new Phone(id++, "Самбуров", "Нурлан", "Азипович", "Украина, г.Львов", "+9 847 56 47", "5431 4567 7685 8917", 6748, 6748, Time.valueOf("0:60:00"), Time.valueOf("00:20:00"), 15000),
                new Phone(id++, "Саломон", "Остап", "Бендер", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:29:00"), Time.valueOf("00:00:00"), 30000),
                new Phone(id++, "Ракицкий", "Семен", "Осипович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:24:00"), Time.valueOf("00:00:00"), 3000),
                new Phone(id++, "Раков", "Сергей", "Акимович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:60:00"), Time.valueOf("00:00:00"), 20000),
                new Phone(id++, "Трусов", "Костя", "Никитович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:59:00"), Time.valueOf("00:12:00"), 13000),
                new Phone(id++, "Астахов", "Геннадий", "Осипович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:19:00"), Time.valueOf("00:02:00"), 1000),
                new Phone(id++, "Овчикон", "Тихан", "Самирович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:09:00"), Time.valueOf("00:01:00"), 2000),
                new Phone(id++, "Олкал", "Олег", "Йосипович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:02:00"), Time.valueOf("00:39:00"), 3999),
                new Phone(id++, "Муштиков", "Алексей", "Самирович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:29:00"), Time.valueOf("00:00:00"), 1000),
                new Phone(id++, "Дурманов", "Соломон", "Амирович", "Германия, г.Дрезден", "+9 847 56 47", "5431 4567 7685 8917", 678, 1010, Time.valueOf("00:33:00"), Time.valueOf("00:12:00"), 2000)
        };
        Phone test = new Phone();
        System.out.println("a) сведения об абонентах, у которых время внутригородских разговоров превышает заданное;");
        test.limitCity(mas);
        System.out.println("b) сведения об абонентах, которые пользовались междугородной связью;");
        test.limitIntel(mas);
        Arrays.sort(mas);
        System.out.println("c) сведения об абонентах в алфавитном порядке.");
        for (int i = 0; i < mas.length; i++) {
            System.out.println(mas[i] + "\n");
        }
        System.out.println("д) сведения об первых 10 абонентов у который самый большой трафик интернета");
        test.traffic(mas);

    }

}
